"""Сформувати функцію для введення з клавіатури послідовності чисел і виведення
її на екран у зворотному порядку (завершаючий символ послідовності – крапка)"""
import timeit


def reverse(n):
    if len(n) == 1:
        return n[0]
    else:
        return (n[len(n) - 1] + reverse(n[0:len(n) - 1])) # Поки не закінчаться елементи,
        # додаємо елементи з кінця списку в початок,звертаючись до функції знову і знову


def reverse_iter(n):
    n1 = []
    m = len(n)
    for i in range(m):
        n1.append(n[m - i - 1])
    return n1


n = []
item = 0
k = 0
while item != '.':  # Ввід елементів, поки не зустрінеться крапка
    k += 1
    item = input(f'Введіть {k} елемент: ')
    n.append(item)
else:
    n.pop()  # Видаляємо крапку і отримуємо новий список для подальших дій. Я вважаю, крапка є стопом,
    # але не відноситься
    # до списку, тому далі я її не враховуватиму і не виводитиму в новому перевернутому списку
print(n)

check = int(input('Виберіть тип виконання операції: 1 - рекурсія, 2 - ітерація. '))
if check == 1:
    print(reverse(n))  # Вибір виконання
elif check == 2:
    print(reverse_iter(n))

t = timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)  # Обрахування часу виконання програми
print(f"Програма виконана за {t} секунд")
